
{
  "title":"Assignments",
  "content":"This section contains the labs that were done during class, along with example solutions, and a small section of miscellaneous items.\nLabs and Solutions DESCRIPTION FILES SOLUTIONS Lab 3 covered control flow with if-elif-else statements. (PDF) Lab 4 covered control flow with while statements. (PDF) login.py (PY)\nnims1.py (PY)\nnims2.py (PY)\nLab 5 covered the use of lists in storing a dynamic number of values. (PDF) sorting.py (PY)\nreportcard.py (PY)\nLab 6 covered the use of tuples instead of lists and their similarity with strings. (PDF) collision.py (PY)\npiglatin.py (PY)\nLab 7 was a walkthrough tutorial that introduced the idea of objects as opposed to primitive types like ints and floats. By exploring concepts like primitives (e.g. numbers) versus references to objects (e.g. lists), mutability versus immutability, and the effects of scope on objects, we now better understand how to use objects correctly.\nNotes 1. Some commands will not produce the expected results when performed on the shell. Instead, run the commands from a file. I\u0026rsquo;m not sure why this is.\n2. I was under the impression that Python aliases tuples automatically. It turns out this is not the case. In other words:\na = (1, 2, 3)\nb = (1, 2, 3)\nprint a is b\nHowever, you can still alias by saying b = a. Strings are still automatically aliased.\n(PDF) Lab 8 covered the use of member functions in various objects. (PDF) genetic.py (PY) Lab 9 covered the use and syntax of dictionaries. The bulk of the lab was to explore one common use of dictionaries as indexes, in this case, for searching the Web. (PDF)\nnamesages.py (PY)\nwebsearch1.py (PY)\nwebindexer1.py (PY)\nhtmltext.py (PY)\nsmallsites.txt (TXT)\nmitsites20.txt (TXT)\nmitsites50.txt (TXT)\nlocalsites.zip (ZIP)\nnamesages_soln.py (PY)\nwebindexer1_soln.py (PY)\nLab 10 covered a more advanced use of dictionaries. The bulk of the lab was to improve the web indexer we built in the previous lab. (PDF)\ninventory.py (PY)\nwebsearch2.py (PY)\nwebindexer2.py (PY)\ninventory_soln.py (PY)\nwebindexer2_soln.py (PY)\nMiscellaneous Optional Assignment (PDF): This walks you through the building of a computer from scratch. Starting at the gate level, you\u0026rsquo;ll understand how a computer works.\nOperator Cheat Sheet (PDF): This lists some of the various arithmetic and boolean (comparison, equality, and logic) operators we\u0026rsquo;ve learned.\n"}


